<?php

declare(strict_types = 1);

namespace DummyGenerator\Provider\Languages\ckb_IQ;

use DummyGenerator\Core\Person as BasePerson;

class Person extends BasePerson
{
    /** @var string[] */
    protected array $maleNameFormats = [
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    ];

    /** @var string[] */
    protected array $femaleNameFormats = [
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    ];

    /** @var string[] */
    protected array $firstNameMale = [
        'ئارام', 'ئاراس', 'ئاراز', 'ئاکام', 'ئاکۆ', 'ئاسۆ', 'ئاوات', 'ئاریان', 'ئالان', 'ئاکار',
        'بابان', 'بەختیار', 'بەرزان', 'بنیاد', 'بلند', 'بەرهەم', 'بەهۆز', 'بەرهام', 'بلال',
        'چیا', 'دانا', 'دلێر', 'دڵشاد', 'دیاکۆ', 'دیار',
        'فەرهاد',
        'گۆران', 'گەیلان',
        'هاوار', 'هاوڕێ', 'هەڵمەت', 'هەردی', 'هۆشیار', 'هۆزان', 'هەژار', 'هەمن', 'هەرش', 'هۆشەنگ',
        'جوامێر', 'جیهان',
        'کاروان', 'کارزان', 'کاوە', 'کۆچەر', 'کامەران', 'کاوان',
        'لاوە',
        'نەوزاد', 'نەورۆز', 'نەچیر',
        'پەیام', 'پێشەوا',
        'ڕەبین', 'ڕەبوار', 'ڕامیار', 'ڕزگار', 'ڕۆژهات', 'ڕەواند', 'ڕێباز', 'ڕەکار', 'ڕزان', 'ڕۆبار', 'ڕستەم',
        'سەردار', 'سیروان', 'سۆران', 'سالار', 'سەرهەد', 'سەروان',
        'شاسوار', 'شڤان', 'شۆڕش', 'شیرزاد',
        'وریا', 'وەلات',
        'خەبات', 'خۆشناو',
        'یاد', 'یادگار',
        'زانا', 'زریان', 'زیرەک', 'زریار', 'زرار',
        'ژیار',
    ];

    /** @var string[] */
    protected array $firstNameFemale = [
        'ئاڤین', 'ئاڤان', 'ئاڤیستا', 'ئاواز', 'ئاڤا', 'ئاڵا',
        'بەهار', 'بەریوان', 'بێستان', 'بەیان', 'بێخاڵ', 'باران',
        'چیمەن', 'چنار', 'چرا',
        'دیلان', 'دڵنیا', 'دڵشاد', 'دەشنێ',
        'ئەڤار',
        'گەلاوێژ', 'گوڵاڵە', 'گوڵستان', 'گوڵنار',
        'هەنار', 'هانا', 'هەستی', 'هاڤین', 'هێرۆ',
        'ژینا', 'ژین', 'ژیان', 'ژیلا',
        'جوان',
        'کانی',
        'لاڤا', 'لاوین', 'لەیلا',
        'میژگین',
        'نازدار', 'نیشتیمان',
        'ڕەوان', 'ڕۆژان', 'ڕۆژین', 'ڕۆزا', 'ڕوناک',
        'سارا', 'سازان', 'سیڤین', 'شادی', 'سۆنیا', 'سۆز', 'سروا',
        'شنە', 'شەڤین', 'شیلان',
        'ترێفا', 'تارا',
        'ڤالا', 'ڤیان',
        'خەزەڵ', 'خوناو',
        'زریان', 'زریکا',
    ];

    /** @var string[] */
    protected array $lastName = [
        'بارزانی', 'تالەبانی', 'زێباری', 'جافی', 'هەورامی', 'کاکەیی', 'سۆرانی',
        'سلێمانی', 'هەولێری', 'دهۆکی', 'گەرمیانی', 'بۆتانی', 'مەروانی', 'جزیری',
        'خۆشناوی', 'باجەڵانی', 'پیرۆتی', 'هەمەوەندی', 'شوانی', 'موکریانی',
        'زەنگەنە', 'کوردستانی', 'ڕۆژهەڵاتی', 'کەرکووکی', 'زاخۆیی', 'کۆیی',
        'ئاکرەیی', 'ڕەواندزی', 'سنەیی', 'مەهابادی', 'بۆکانی', 'پێنجوێنی',
        'هەڵەبجەیی', 'چەمچەماڵی', 'خانەقینی', 'ڕانیەیی', 'شارباژێری',
    ];

    /** @var string[] */
    protected array $titleMale = ['کاک', 'مام', 'دکتۆر', 'مامۆستا', 'بەڕێز'];

    /** @var string[] */
    protected array $titleFemale = ['خانم', 'دکتۆر', 'مامۆستا', 'بەڕێز'];
}
